bdrewery/freebsd/share/man/man9/VOP.9
.\" Copyright (c) 2014 Bryan Drewery
.\"
.\" All rights reserved.
.\"
.\" This program is free software.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE DEVELOPERS ``AS IS'' AND ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
.\" OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
.\" IN NO EVENT SHALL THE DEVELOPERS BE LIABLE FOR ANY DIRECT, INDIRECT,
.\" INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
.\" NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
.\" DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
.\" THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
.\" (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
.\" THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
.\"
.\" $FreeBSD$
.\"
.Dd January 31, 2014
.Dt VOP 9
.Os
.Sh NAME
.Nm VOP
.Nd kernel interface for vnode operations
.Sh DESCRIPTION
The VOP interface is an abstraction layer of functions that
will call the underlying file system's function for the passed in vnode,
while managing some locking requirements on the way in.
.Pp
File systems that do not implement a VOP operation should use the appropriate
.Fa vfs_std
function from
.Pa src/sys/kern/vfs_default.c
rather than implementing empty functions or casting to
.Fa eopnotsupp .
.Sh FILES
.Bl -tag -width sys/tools/vnode_if.awk -compact
.It Pa sys/kern/vnode_if.src
The source and definition for all VOP functions.
Locking requirements and parameters are also documented here for each
VOP function.
.It Pa sys/tools/vnode_if.awk
Script for generating actual VOP header files.
.El
.Sh SEE ALSO
.Xr vnode 9 ,
.Xr VOP_ACCESS 9 ,
.Xr VOP_ACLCHECK 9 ,
.Xr VOP_ADVISE 9 ,
.Xr VOP_ADVLOCK 9 ,
.Xr VOP_ALLOCATE 9 ,
.Xr VOP_ATTRIB 9 ,
.Xr VOP_BWRITE 9 ,
.Xr VOP_CREATE 9 ,
.Xr VOP_FSYNC 9 ,
.Xr VOP_GETACL 9 ,
.Xr VOP_GETEXTATTR 9 ,
.Xr VOP_GETPAGES 9 ,
.Xr VOP_GETVOBJECT 9 ,
.Xr VOP_INACTIVE 9 ,
.Xr VOP_IOCTL 9 ,
.Xr VOP_LINK 9 ,
.Xr VOP_LISTEXTATTR 9 ,
.Xr VOP_LOCK 9 ,
.Xr VOP_LOOKUP 9 ,
.Xr VOP_OPENCLOSE 9 ,
.Xr VOP_PATHCONF 9 ,
.Xr VOP_PRINT 9 ,
.Xr VOP_RDWR 9 ,
.Xr VOP_READDIR 9 ,
.Xr VOP_READLINK 9 ,
.Xr VOP_REALLOCBLKS 9 ,
.Xr VOP_REMOVE 9 ,
.Xr VOP_RENAME 9 ,
.Xr VOP_REVOKE 9 ,
.Xr VOP_SETACL 9 ,
.Xr VOP_SETEXTATTR 9 ,
.Xr VOP_STRATEGY 9 ,
.Xr VOP_VPTOCNP 9 ,
.Xr VOP_VPTOFH 9 ,
.Xr VFS 9
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.4 .
